OdGeInterval.isPeriodicallyOn(System.Double,System.Double*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Checks whether the specified value is periodically on this interval.
\param period [in]  Period.
\param value [in/out] Value.
\returns
true if and only if there is a positive integer N such that
value + N * period
is on this interval. If so, returns that value.

OdGeInterval.isEqualAtLower(System.Double)
\details
Returns true if and only if lower bounds of the specified Interval and this Interval are equal.
\remarks
Returns true if and only if
1. This Interval is bounded below, and the lower bound is equal to value within tolerance.
\param value [in]  The value to be tested.

OdGeInterval.isEqualAtLower(OdGeInterval!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if and only if lower bounds of the specified Interval and this Interval are equal.
\remarks
Returns true if and only if
1. Both this Interval and otherInterval are unbounded below or bounded
below with their lower bounds equal within tolerance.
\param otherInterval [in]  The Interval to be tested.

OdGeInterval.isEqualAtUpper(System.Double)
\details
Returns true if and only if upper bounds of the specified Interval and this Interval are equal.
\remarks
Returns true if and only if
1. This Interval is bounded above, and the upper bound is equal to value within tolerance().
\param value [in]  The value to be tested.

OdGeInterval.isEqualAtUpper(OdGeInterval!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if and only if upper bounds of the specified Interval and this Interval are equal.
\remarks
Returns true if and only if
1. Both this Interval and otherInterval are unbounded above or bounded
above with their upper bounds equal within tolerance().
\param otherInterval [in]  The Interval to be tested.

OdGeInterval.op_Inequality(OdGeInterval!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Comparison operator for the OdGeInterval object.
\param otherInterval [in]  Other interval.
\returns
A boolean value that indicates whether the input interval is not identical to this interval.

OdGeInterval.op_Equality(OdGeInterval!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Comparison operator for the OdGeInterval object.
\param otherInterval [in]  Other interval.
\returns
A boolean value that indicates whether the input interval is identical to this interval.

OdGeInterval.isOverlapAtUpper(OdGeInterval!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeInterval*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if and only if the specified Interval and this Interval overlap at the upper bound of this Interval.
\remarks
Returns true if and only if
1.  This Interval is bounded above, otherInterval is bounded below.
2.  Neither Interval is a singleton.
3.  The Intervals Intersect.
4.  otherInterval does not contain this one.
5.  The upper bound of this Interval is contained in otherInterval.
6.  The lower bound of otherInterval is contained within this one.
If all these conditions are met, this function returns the intersection of the Intervals.
\param otherInterval [in]  The Interval to be tested.
\param overlap [out]  Receives the overlap of the Intervals.

OdGeInterval.isContinuousAtUpper(OdGeInterval!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if and only if the specified Interval is continuous with the upper bound of this Interval.
\remarks
Returns true if and only if this Interval is bounded above, otherInterval is bounded below,
and the upper bound of this Interval is equal to the lower bound of otherInterval within tolerance().
\param otherInterval [in]  The Interval to be tested.

OdGeInterval.clamp(System.Double)
\details
Corrects the parameter so that it belongs to the interval.
If parameter is already within interval, then it is returned as is.
Otherwise parameter is moved to closest of endpoints.
\param value [in]  The parameter to be corrected.

OdGeInterval.contains(System.Double)
\details
Checks whether this interval contains the specified value within tolerance().
\param value [in]  The value to be tested.
\returns
true if and only if this interval contains the specified value.

OdGeInterval.contains(OdGeInterval!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Checks whether this interval contains the specified interval within tolerance().
\param otherInterval [in]  The interval to be tested.
\returns
true if and only if this interval contains the specified interval.

OdGeInterval.isDisjoint(OdGeInterval!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if and only if the specified interval is disjoint from this interval.
\remarks
Returns true if and only if this interval does not intersect otherInterval within tolerance().
\param otherInterval [in]  The interval to be tested.

OdGeInterval.isSingleton
\details
Returns true if and only if this interval object is a singleton.
\remarks
Returns true if and only if this interval is bounded, and the upper and lower bounds are equal within tolerance().

OdGeInterval.isUnBounded
\details
Returns true if and only if this interval is unbounded above or below.

OdGeInterval.isBoundedBelow
\details
Returns true if and only if this interval is bounded below.

OdGeInterval.isBoundedAbove
\details
Returns true if and only if this interval is bounded above.

OdGeInterval.isBounded
\details
Returns true if and only if this interval is bounded above and below.

OdGeInterval.finiteIntersectWith(OdGeInterval!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeInterval*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Find finite sub-interval belonging both to the specified range and this one
\param range [in]  The interval to be intersected.
\param result [out]  Receives the intersected interval.
\returns
true if and only if the specified interval intersects with this one,
and the resulting interval is bounded.

OdGeInterval.intersectWith(OdGeInterval!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeInterval*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Intersects the specified interval from this one.
\param otherInterval [in]  The interval to be intersected.
\param result [out]  Receives the intersected interval.
\returns
true if and only if this specified interval intersects with this one.

OdGeInterval.subtract(OdGeInterval!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeInterval*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeInterval*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Subtracts the specified interval from this interval.
\param otherInterval [in]  The interval to be subtracted from this one.
\param lInterval [out]  Receives the Left (or only) interval.
\param rInterval [out]  Receives the right interval.
\returns
Number of intervals, and the intervals, resulting from the subtraction.
\remarks
return value   Results
0              Empty result
1              Single interval in lInterval
2              Left in lInterval, Right in rInterval.

OdGeInterval.getMerge(OdGeInterval!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeInterval*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the smallest interval containing both the specified interval and this interval.
\param otherInterval [in]  The interval to be merged with this one.
\param result [out]  Receives the merged interval.

OdGeInterval.swap
\details
Swaps the parameters of this interval.
\returns
Reference to this interval.

OdGeInterval.scale(System.Double)
\details
Scales the parameters of this interval by the provided scale factor.
\param factor [in]  Scale factor.
\returns
Reference to this interval.
\remarks
On negative scale factor the ends of the interval will not be swapped.

OdGeInterval.setTolerance(System.Double)
\details
Sets the boundary tolerance for this interval.
\param tol [in]  Boundary tolerance.
\returns
Reference to this interval.

OdGeInterval.setLower(System.Double)
\details
Sets the lower bound for this interval.
\param lower [in] Lower bound.
\returns
Reference to this interval.

OdGeInterval.setUpper(System.Double)
\details
Sets the upper bound for this interval.
\param upper [in]  Upper bound.

OdGeInterval.set
\details
Unbounds this interval.
\returns
Reference to this interval.

OdGeInterval.set(System.Boolean,System.Double)
\details
Sets the parameters for this interval according to the arguments.
\param boundedBelow [in]  Determines if bound specifies a lower or an upper bound.
\param bound [in]  Specifies a lower bound if boundedBelow is true, or an upper
bound if it is false.
\returns
Reference to this interval.

OdGeInterval.set(System.Double,System.Double)
\details
Sets the parameters for this interval according to the arguments.
\param lower [in]  Lower bound.
\param upper [in]  Upper bound.
\returns
Reference to this interval.

OdGeInterval.eval(System.Double)
\details
Returns parameter L + (R-L) * t for given ratio t.
Note: if the interval is unbounded, behavior is undefined!
\param ratio [in]  Arbitrary number

OdGeInterval.tolerance
\details
Returns the boundary tolerance for this interval.

OdGeInterval.length
\details
Returns the length of this interval.
\returns
-1.0 if this interval is unbounded above or below.

OdGeInterval.getEnd(System.Int32)
\details
Returns the parameter of interval's end.
\param index  Must be 0 (interval start) or 1 (interval end), otherwise behavior is undefined.

OdGeInterval.getBounds(System.Double*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the bounds of this interval.
\param lower [out]  Receives the Lower bound.
\param upper [out]  Receives the Upper bound.

OdGeInterval.element
\details
Returns a point on this interval.
\remarks
Bounded Above   Bounded Below          Returns
Yes             ---                    Upper Bound
No              Yes                    Lower Bound
No              No                     0.0

OdGeInterval.middle
\details
Returns the center point of this interval.
\remarks
This value is meaningful if and only if the interval has both lower and upper bounds.

OdGeInterval.upperBound
\details
Returns the upper bound of this interval.
\remarks
This value is meaningful if and only if the interval has an upper bound.

OdGeInterval.lowerBound
\details
Returns the lower bound of this interval.
\remarks
This value is meaningful if and only if the interval has a lower bound.

OdGeInterval.#ctor(System.Boolean,System.Double,System.Double)
\details
Constructor for the OdGeInterval class.
\param boundedBelow [in]  Determines if the interval is bounded below.
\param bound [in]  Upper or lower bound.
\param tol [in]  Boundary tolerance.
If boundedBelow is true, the constructor sets the lower bound also to bound; otherwise the interval remains unbounded below.

OdGeInterval.#ctor(System.Double,System.Double,System.Double)
\details
Constructor for the OdGeInterval class.
\param lower [in]  Lower bound.
\param upper [in]  Upper bound.
\param tol [in]  Boundary tolerance.

OdGeInterval.#ctor(System.Double)
\details
Constructor for the OdGeInterval class. Creates an unbounded interval with the specified tolerance.
\param tol [in]  Boundary tolerance.